##todo: Самостоятельная работа

# Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.
# Примечание: сторону квадрата получаем через функцию input().
print("input x")
x = int(input())
print("input y")
y = int(input())
print(x + y)
print(x - y)
print(x / y)
print(x * y)
print(x // y)
print(x % y)
print(x ** y)

